# Khipus.ai
## Introduction to Machine Learning
### Data Preparation
<span>Â© Copyright Notice 2025, Khipus.ai - All Rights Reserved.</span>

### Assignment 1
### Name :

## Assignment Instructions
Using the Titanic dataset provided:
1. Import the Titanic.csv file into a pandas dataframe
2. Perform a detailed data exploration.
3. Clean the dataset by addressing missing values.
4. Select relevant features for predicting survival.
5. Split the dataset into training and testing sets (80%-20% split).

## 1. Import the Titanic dataset

In [ ]:
# Import necessary libraries

In [ ]:
# Your code here

# Load the Titanic dataset

## 2. Data Exploration
Before working with the dataset, it's important to understand its structure, data types, and summary statistics. Below are examples of how to explore the data.

In [ ]:
# Your code here

# Display the first few rows of the dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [ ]:
# Display summary statistics

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

In [ ]:
# Check for missing values

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

## 3. Data Cleaning (addressing missing values)
Real-world datasets often contain missing values, duplicate rows, or incorrect data. Cleaning the data ensures its quality and usability for analysis.

In [ ]:
# Fill missing 'Age' with the median

# Fill missing 'Embarked' with the mode

# Drop 'Cabin' as it has too many missing values

# Your code here

# Confirm there are no missing values left

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           1
Embarked       0
dtype: int64

## Feature Selection 
To build an effective machine learning model, selecting relevant features is crucial. 
Select relevant features for predicting survival.

In [ ]:
# Define the features you want to use
# Select features and target
# Your code here
# Select the features from the DataFrame
# Select the target variable from the DataFrame

## 5. Splitting Training and Test Data

In [ ]:
# Your code here
# Split into training and test sets

<class 'pandas.core.frame.DataFrame'>
Index: 334 entries, 336 to 102
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Pclass      334 non-null    int64
 1   Age         334 non-null    float64
 2   SibSp       334 non-null    int64
 3   Parch       334 non-null    int64
 4   Fare        333 non-null    float64
 5   Sex_male    334 non-null    bool
 6   Embarked_Q  334 non-null    bool
 7   Embarked_S  334 non-null    bool
dtypes: bool(3), float64(2), int64(3)
memory usage: 16.6 KB

In [ ]:
# Your code here
# Display basic information about the dataset X_train

<class 'pandas.core.frame.DataFrame'>
Index: 334 entries, 336 to 102
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Pclass      334 non-null    int64
 1   Age         334 non-null    float64
 2   SibSp       334 non-null    int64
 3   Parch       334 non-null    int64
 4   Fare        333 non-null    float64
 5   Sex_male    334 non-null    bool
 6   Embarked_Q  334 non-null    bool
 7   Embarked_S  334 non-null    bool
dtypes: bool(3), float64(2), int64(3)
memory usage: 16.6 KB

In [ ]:
# Your code here
# Display basic information about the dataset X_test

<class 'pandas.core.frame.DataFrame'>
Index: 84 entries, 321 to 66
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Pclass      84 non-null     int64
 1   Age         84 non-null     float64
 2   SibSp       84 non-null     int64
 3   Parch       84 non-null     int64
 4   Fare        84 non-null     float64
 5   Sex_male    84 non-null     bool
 6   Embarked_Q  84 non-null     bool
 7   Embarked_S  84 non-null     bool
dtypes: bool(3), float64(2), int64(3)
memory usage: 4.2 KB